snlkuharlocal/src/Documents/ДоставкаСобственнымТранспортом/ДоставкаСобственнымТранспортом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДоставкаСобственнымТранспортом</name>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <registerRecords>AccumulationRegister.РаспределениеУСОпоНакладным</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаБух</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодРасходов</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидУслуги</name>
      <type>
        <types>CatalogRef.ВидыУслуг</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыТранспортнойкомпании</name>
    <attributes>
      <name>НомерДок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>16</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ЗаявкаВТранспортныйОтдел</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДок</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>CatalogRef.Регионы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоставки</name>
      <type>
        <types>CatalogRef.ПунктыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодРасходов</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/РаспределениеУСОпоНакладным/РаспределениеУСОпоНакладным.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РаспределениеУСОпоНакладным</name>
  <resources>
    <name>РаспределеннаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемНаладной</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНакладной</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоНакладной</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоКоробок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.ЗаявкаВТранспортныйОтдел</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасходов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидУслуги</name>
    <type>
      <types>CatalogRef.ВидыУслуг</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Enums/ТипыДоставки/ТипыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДоставки</name>
  <enumValues>
    <name>Доставка</name>
  </enumValues>
  <enumValues>
    <name>ТранспортнаяКомпания</name>
  </enumValues>
  <enumValues>
    <name>Самовывоз</name>
  </enumValues>
  <enumValues>
    <name>Перегруз</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ДоставкаСобственнымТранспортом/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
		ПериодРасходовТранспорт = Неопределено;
		Для Каждого СтрокаТЧ Из Услуги Цикл
			Если ЗначениеЗаполнено(СтрокаТЧ.ПериодРасходов) Тогда
				ПериодРасходовТранспорт = СтрокаТЧ.ПериодРасходов ;	
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ПериодРасходовТранспорт = Неопределено Тогда
			ПериодРасходовТранспорт = '00010101';
		КонецЕсли;
		
		
		ВсегоРаспределено = 0;
		Движение = Неопределено;
		ТЗ=ДокументыТранспортнойкомпании.Выгрузить();
		ТЗ.Свернуть("ПунктДоставки","Количество");
		тз.Колонки.Добавить("КоэффициентСложности");
		Для каждого СтрТЗ из тз цикл
			если СтрТЗ.ПунктДоставки.КоэффициентСложностиДоставки=Справочники.КоэффициентыСложностиДоставки.ПустаяСсылка() тогда
				СтрТЗ.КоэффициентСложности=1.6;
			иначе
				СтрТЗ.КоэффициентСложности=СтрТЗ.ПунктДоставки.КоэффициентСложностиДоставки.КоэффициентСложности;
			КонецЕсли;	
			если СтрТЗ.Количество>20000 тогда
				СтрТЗ.КоэффициентСложности=СтрТЗ.КоэффициентСложности+6.4;
			ИначеЕсли СтрТЗ.Количество>10000 тогда
				СтрТЗ.КоэффициентСложности=СтрТЗ.КоэффициентСложности+4.8;
			ИначеЕсли СтрТЗ.Количество>5000 тогда
				СтрТЗ.КоэффициентСложности=СтрТЗ.КоэффициентСложности+3.2;			
			ИначеЕсли СтрТЗ.Количество>1500 тогда
				СтрТЗ.КоэффициентСложности=СтрТЗ.КоэффициентСложности+1.6;			
			КонецЕсли;	
		КонецЦикла;	
		ОбщийКоэффициентСложности=ТЗ.Итог("КоэффициентСложности");
		
		//Теперь размазываем ещё и по услугам пропорционально сумме
		для каждого СтрУслуги из Услуги цикл
			Коэффициент=СтрУслуги.Всего/СуммаДокумента;
			
			для каждого Накл из ДокументыТранспортнойкомпании цикл
				если накл.Документ=Неопределено тогда Продолжить;
				КонецЕсли;
				Движение = Движения.РаспределениеУСОпоНакладным.Добавить();	
				Движение.ВидДвижения		= ВидДвиженияНакопления.Приход;		
				Движение.Период				=Дата;	
				Движение.Накладная=накл.Документ.Ссылка;
				Движение.ОбъемНаладной=Накл.Объем;
				СтрокаСвернТЗ=тз.Найти(накл.ПунктДоставки);
				ТекКоэффициентСложности=СтрокаСвернТЗ.КоэффициентСложности;
				КоэффКоличества=Накл.Количество/СтрокаСвернТЗ.Количество;							
				
				ТекКоэффициентСложности=КоэффКоличества*ТекКоэффициентСложности;
				
				Движение.РаспределеннаяСумма=Окр(ТекКоэффициентСложности*СуммаДокумента/ОбщийКоэффициентСложности,2);
				
				//Размазываем отдельно по услугам
				Движение.РаспределеннаяСумма=Движение.РаспределеннаяСумма*Коэффициент;
				Движение.ВидУслуги=СтрУслуги.ВидУслуги;
				
				
				ВсегоРаспределено = ВсегоРаспределено + Движение.РаспределеннаяСумма;
				
				если накл.Документ.метаданные().имя<>"ЗаявкаВТранспортныйОтдел" тогда 
					движение.СуммаНакладной=Накл.Документ.СуммаДокумента;
					если Накл.Документ.ПунктДоставки.ТипДоставки<>Перечисления.ТипыДоставки.ТранспортнаяКомпания тогда
						движение.ПунктДоставки=Накл.Документ.ПунктДоставки;           
					Иначе 
						движение.ПунктДоставки=Накл.Документ.ПунктДоставки.ПунктПерегруза;
					КонецЕсли;
				иначе
					движение.СуммаНакладной=0;
					движение.ПунктДоставки=Накл.Документ.ПунктДоставкиПолучатель;
				КонецЕсли;	
				движение.КоличествоНакладной=Накл.Документ.КоличествоДокумента;
				движение.КоличествоКоробок=Накл.Документ.КоличествоКоробок;
				движение.ДатаОтгрузки=Накл.Документ.ДатаОтгрузки;
				Если ЗначениеЗаполнено(Накл.ПериодРасходов) Тогда
					Движение.ПериодРасходов = Накл.ПериодРасходов;
				Иначе
					Движение.ПериодРасходов = ПериодРасходовТранспорт;
				КонецЕсли;
				
				если накл.Документ.метаданные().имя<>"Перемещение" и накл.Документ.метаданные().имя<>"ЗаявкаВТранспортныйОтдел" тогда
					движение.Контрагент=накл.Документ.Контрагент;
					движение.Подразделение=накл.Документ.Подразделение;
				ИначеЕсли накл.Документ.метаданные().имя="ЗаявкаВТранспортныйОтдел" тогда	
					если накл.Документ.отправитель.Метаданные().Имя="Контрагенты" тогда
						движение.Контрагент=накл.Документ.отправитель;
						если  накл.Документ.Получатель.Метаданные().Имя="Контрагенты" тогда
							движение.Подразделение=накл.Документ.Получатель.Менеджер.Подразделение;
						иначе
							движение.Подразделение=накл.Документ.Получатель.Подразделение;
						КонецЕсли;

					ИначеЕсли накл.Документ.получатель.Метаданные().Имя="Контрагенты" тогда
						движение.Контрагент=накл.Документ.получатель;
						движение.Подразделение=накл.Документ.Отправитель.Подразделение;
					иначе
						движение.Подразделение=накл.Документ.Получатель.Подразделение;				
					КонецЕсли;
					если накл.Документ.Подразделение<>справочники.Подразделения.ПустаяСсылка() тогда
						движение.Подразделение=накл.Документ.Подразделение;
					КонецЕсли;
				иначе
					движение.Подразделение=накл.Документ.складполучатель.Подразделение;	
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;	
		Если ВсегоРаспределено <> СуммаДокумента И Движение <> Неопределено И Дата >= '20130701' Тогда
			Движение.РаспределеннаяСумма = Движение.РаспределеннаяСумма + (СуммаДокумента-ВсегоРаспределено);	
		КонецЕсли;
	
КонецПроцедуры


//СОБЫТИЯ ОБЪЕКТА
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	ЕстьИзменения		=Модифицированность();
	НужноВыгружать		=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	
	Если НЕ ОбменДанными.Загрузка Тогда		
		//Кухарь 06.01.16 начало
		//Ни на что не влияет, можно не контролировать
		//КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		//Кухарь 06.01.16 конец
		Если Отказ Тогда Возврат КонецЕсли; 		
	КонецЕсли;	
	
	Если Отказ Тогда Возврат КонецЕсли;
	
	Если ЕстьИзменения Тогда
		СуммаДокумента=Услуги.Итог("Всего");	
	КонецЕсли; 
	
	
	//Катаев+ 25/06/13 Убрал комментарии. Проблема в первый раз была из-за того что на самом документе стояла авторегистрация.
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		ДокОснование		= Основание;
		
		ИБ 					= Основание.ИБ;
		Организация 		= Основание.Организация;
		Подразделение		= Основание.Склад.Подразделение;
		
		Контрагент 			= Основание.Контрагент;
		КонтрагентЦБ		= Контрагент.Ведущий;
		Договор 			= Основание.Договор;		
		
		Сумма 				= Основание.СуммаДокумента;
		Валюта 				= Основание.Валюта;
		
		СтатьяДДС			= Справочники.СтатьиЗатрат.НайтиПоНаименованию("Приход от покупателей");
		
		Комментарий 		= "На основании: "+Основание;		
	КонецЕсли;	
КонецПроцедуры

////Кухарь 28.01.19 начало
////Всё переделал
Процедура ОбработкаПроведенияСтарая(Отказ, РежимПроведения) Экспорт	
	
	ПериодРасходовТранспорт = Неопределено;
	
	Для Каждого СтрокаТЧ Из Услуги Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.ПериодРасходов) Тогда
			ПериодРасходовТранспорт = СтрокаТЧ.ПериодРасходов ;	
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ПериодРасходовТранспорт = Неопределено Тогда
		ПериодРасходовТранспорт = '00010101';
	КонецЕсли;
	//крохин конец 09.06.2013
	
	//крохин начало 26.07.2015
	//вместо объема используем количество
	//СОбъем=ДокументыТранспортнойкомпании.Итог("Объем");	
	//ССумма=СуммаДокумента;
	//если СОбъем=0 тогда
	//	СОбъем=1;
	//КонецЕсли;
	СКоличество=ДокументыТранспортнойкомпании.Итог("Количество");	
	ССумма=СуммаДокумента;
	если СКоличество=0 тогда
		СКоличество=1;
	КонецЕсли;
	
	//крохин конец 26.07.2015
	
	//крохин начало 02.08.2013
	//для коррекции копеек после распределения
	ВсегоРаспределено = 0;
	Движение = Неопределено;
	//крохин конец 02.08.2013
	
	для каждого Накл из ДокументыТранспортнойкомпании цикл
		если накл.Документ=Неопределено тогда Продолжить;
		КонецЕсли;
		Движение = Движения.РаспределениеУСОпоНакладным.Добавить();
		
		Движение.ВидДвижения		= ВидДвиженияНакопления.Приход;
		
		Движение.Период				=Дата;
		
		Движение.Накладная=накл.Документ.Ссылка;
		//крохин начало 02.08.2013
		//объем может поменяться после создания УСО
		//Движение.РаспределеннаяСумма=накл.Документ.ОбъемДокумента*ССумма/СОбъем;
		//Движение.ОбъемНаладной=Накл.Документ.ОбъемДокумента;
		//крохин начало 26.07.2015
		//вместо объема используем количество
		//Если Дата >= '20130701' Тогда
		//	Движение.РаспределеннаяСумма=Окр(накл.Объем*ССумма/СОбъем,2);
		//	Движение.ОбъемНаладной=Накл.Объем;	
		//Иначе
		//	Движение.РаспределеннаяСумма=накл.Документ.ОбъемДокумента*ССумма/СОбъем;
		//	Движение.ОбъемНаладной=Накл.Документ.ОбъемДокумента;
		//КонецЕсли;
		Если Дата >= '20130701' Тогда
			Движение.РаспределеннаяСумма=Окр(накл.Количество*ССумма/СКоличество,2);
			Движение.ОбъемНаладной=Накл.Объем;	
		Иначе
			Движение.РаспределеннаяСумма=накл.Документ.КоличествоДокумента*ССумма/СКоличество;
			Движение.ОбъемНаладной=Накл.Документ.ОбъемДокумента;
		КонецЕсли;
		//крохин конец 26.07.2015
		
		//для коррекции копеек после распределения
		ВсегоРаспределено = ВсегоРаспределено + Движение.РаспределеннаяСумма;
		//крохин конец 02.08.2013
		если накл.Документ.метаданные().имя<>"ЗаявкаВТранспортныйОтдел" тогда 
			движение.СуммаНакладной=Накл.Документ.СуммаДокумента;
			если Накл.Документ.ПунктДоставки.ТипДоставки<>Перечисления.ТипыДоставки.ТранспортнаяКомпания тогда
				движение.ПунктДоставки=Накл.Документ.ПунктДоставки;           
			Иначе 
				движение.ПунктДоставки=Накл.Документ.ПунктДоставки.ПунктПерегруза;
			КонецЕсли;
		иначе
			движение.СуммаНакладной=0;
			движение.ПунктДоставки=Накл.Документ.ПунктДоставкиПолучатель;
		КонецЕсли;
		
		движение.КоличествоНакладной=Накл.Документ.КоличествоДокумента;
		движение.КоличествоКоробок=Накл.Документ.КоличествоКоробок;
		движение.ДатаОтгрузки=Накл.Документ.ДатаОтгрузки;
		//крохин начало 09.06.2013
		Если ЗначениеЗаполнено(Накл.ПериодРасходов) Тогда
			Движение.ПериодРасходов = Накл.ПериодРасходов;
		Иначе
			Движение.ПериодРасходов = ПериодРасходовТранспорт;
		КонецЕсли;
		//крохин конец 09.06.2013
		
		если накл.Документ.метаданные().имя<>"Перемещение" и накл.Документ.метаданные().имя<>"ЗаявкаВТранспортныйОтдел" тогда
			движение.Контрагент=накл.Документ.Контрагент;
			движение.Подразделение=накл.Документ.Подразделение;
		ИначеЕсли накл.Документ.метаданные().имя="ЗаявкаВТранспортныйОтдел" тогда	
			если накл.Документ.отправитель.Метаданные().Имя="Контрагенты" тогда
				движение.Контрагент=накл.Документ.отправитель;
				движение.Подразделение=накл.Документ.Получатель.Подразделение;
			ИначеЕсли накл.Документ.получатель.Метаданные().Имя="Контрагенты" тогда
				движение.Контрагент=накл.Документ.получатель;
				движение.Подразделение=накл.Документ.Отправитель.Подразделение;
			иначе
				движение.Подразделение=накл.Документ.Получатель.Подразделение;				
			КонецЕсли;
			если накл.Документ.Подразделение<>справочники.Подразделения.ПустаяСсылка() тогда
				движение.Подразделение=накл.Документ.Подразделение;
			КонецЕсли;
			
			
		иначе
			движение.Подразделение=накл.Документ.складполучатель.Подразделение;	
		КонецЕсли;
		
	КонецЦикла;
	Если ВсегоРаспределено <> СуммаДокумента И Движение <> Неопределено И Дата >= '20130701' Тогда
		Движение.РаспределеннаяСумма = Движение.РаспределеннаяСумма + (СуммаДокумента-ВсегоРаспределено);	
	КонецЕсли;
	
	
	
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры
////Кухарь 28.01.19 конец
